# # Цикл for  range()
# for i in range(11):
#     print("Hihihaha")
#     print(i)
# for i in range (5,11):
#     print(i)
# for i in range (0,20,2): # -  старт ,стоп , крок може бути від'ємний 
#     print(i) 
# for x in range (1,11):
#     a = int(input("Введіть число "))
#     if a<0:
#         continue
#     print(a)
# word = "Hello" # Рядок це формат STR усе що в лапках
# for a in word:
#     print("Letter: ",a)
# word = "#im@ssist @*@*@ -@-@ "
# for a in word:
#     if a == "@":
#         print("a", end="")
#     elif a == "b":
#         print("*", end="")
#     elif a == "g":
#         print("-", end="")
#     elif a == "A":
#         print("#", end="")
#     elif a == "b":
#         print("♥️", end="")
#     elif a == "g":
#         print("☺️", end="")
#     else:
#         print(a, end="")

# 1. За допомогою функції range() сформуйте таку послідовність чисел: 0, 1, 2, ....,10.
# Результат виведіть у вигляді послідовності чисел.
# for d in range(0,11,1):
#     print(d)
# 2. За допомогою функції range() сформуйте таку послідовність чисел: 10, 9, 8, ..., 0.
# Результат виведіть у вигляді послідовності чисел, записаних через пробіл в один
# рядок.
# for f in range(10,-1,-1):
#     print(f)
# 3. За допомогою функції range() сформуйте таку послідовність чисел: 3, 7, 11, 15, 19
# Результат виведіть у вигляді послідовності чисел, записаних через пробіл в один
# рядок.
# for f in range(3,23,4):
#      print(f)
# 5. За допомогою функції range() сформуйте таку послідовність чисел: -10, -8, -6, -4, -2.
# Результат виведіть у вигляді послідовності чисел, записаних через пробіл в один
# рядок.
# for f in range(-10,-1,2):
#      print(f)
# 6. Дано два цілих числа A і B (при цьому A ≤ B). Виведіть усі числа від A до B включно.
# A = int(input())
# B = int(input())
# for f in range(A,1+B,1):
#      print(f)
# 7. Дано 10 цілих чисел. Обчисліть їхню суму. Напишіть програму, що використовує
# найменшу кількість змінних.
# suma = 0
# for f in range(10):
#     b = int(input())
#     suma += b
# print(suma)
# 11.Вводиться натуральне число n. Обчислити суму всіх натуральних чисел, менших за n,
# які кратні або 3, або 5. Результат (суму) вивести на екран. : n = 10, маємо числа: 3, 5,
# 6, 9. Їхня сума дорівнює 23.
Cyma = 0
A = int(input())
for f in range(1,A):
    if f%3 == 0 or f%5 == 0:
        Cyma+=f
print(Cyma)