#1. Є 3 числа. Знайти найбільше з них.(можна дати аналогічну задачу на найменше число)
d = int(input("Введіть 1 число "))
b = int(input("Введіть 2 число "))
f = int(input("Введіть 3 число "))
if d <= b and f <= b:
    print("Самое большое число", b)
elif b <= d and f <= d:
    print("Самое большое число", d)
else:
    print("Самое большое число", f)
#2. Дано три цілих числа. Визначте, скільки серед них таких, що збігаються. Програма
#має вивести одне з чисел: 3 (якщо всі збігаються), 2 (якщо два збігаються) або 0
#(якщо всі числа різні).
a = int(input("Введіть 1 число: "))
c = int(input("Введіть 2 число: "))
b = int(input("Введіть 3 число: "))
if a == b == c:
    print("3")
elif a == b or a == c or b == c:
    print("2")
else:
    print("0")