# Завдання 1: "Візитка" (Легко) 

# Створи вікно з 3-ма Label: Ім'я, Клас, Хобі. Кожен з різним кольором тексту.
# Використай Frame для групування і красивий темний фон.

# Імпортуємо бібліотеку tkinter (офіційне скорочення: tk)
import tkinter as tk

# 1. Створюємо головне вікно додатку
window = tk.Tk()

# 2. Налаштовуємо вікно
window.title("Візитка")    # Заголовок вікна (текст зверху)
window.geometry("500x400")             # Розмір: 500px ширина × 400px висота
window.configure(bg="#1d1d1d")         # Колір фону (темно-синій)
window.resizable(False, False)         # Заборона зміни розміру (ширина, висота)

greeting = tk.Label(
    window,                      # На якому вікні розмістити (батьківський віджет)
    text="Имя: Анонимно",   # Текст
    font=("Arial", 24, "bold"),   # Шрифт: (назва, розмір, стиль)
    fg="orange",                   # Колір тексту (foreground)               # Колір фону напису (background)
    padx=20,                      # Внутрішній відступ по горизонталі
    pady=10,                      # Внутрішній відступ по вертикалі
)
greeting.pack()

greeting2 = tk.Label(
    window,                      # На якому вікні розмістити (батьківський віджет)
    text="Клас: 50",   # Текст
    font=("Arial", 24, "bold"),   # Шрифт: (назва, розмір, стиль)
    fg="blue",                   # Колір тексту (foreground)               # Колір фону напису (background)
    padx=20,                      # Внутрішній відступ по горизонталі
    pady=10,                      # Внутрішній відступ по вертикалі
)
greeting2.pack()

greeting3 = tk.Label(
    window,                      # На якому вікні розмістити (батьківський віджет)
    text="Хобі: Ошибка",   # Текст
    font=("Arial", 24, "bold"),   # Шрифт: (назва, розмір, стиль)
    fg="green",                   # Колір тексту (foreground)              # Колір фону напису (background)
    padx=20,                      # Внутрішній відступ по горизонталі
    pady=10,                      # Внутрішній відступ по вертикалі
)
greeting3.pack()

# 3. ЗАПУСКАЄМО ГОЛОВНИЙ ЦИКЛ (без цього вікно миттєво закриється!)
window.mainloop()