# #. Вводиться дійсне число. Потрібно визначити, чи його ціла частина кратна 3.
# a = int(input("  "))
# print(a % 3 == 0)
# #. Напишіть програму, яка зчитує три числа і виводить їх різницю. Кожне число записано в окремому рядку.
# a = int(input("  "))
# f = int(input("  "))
# d = int(input("  "))
# print(a - f - d)
# #2. Є ціле число. Якщо воно є додатнім, то потрібно додати до нього 1, в іншому випадку нічого не робимо. В кінці потрібно побачити результат
# v = int(input())
# if v > 0:
#     v += 1
#     print(v,"Це додатне число")
# elif v < 0:
#     print(v,)
# #. Дано два цілих числа. Виведіть значення найменшого з них.
# r = int(input(""))
# t = int(input(""))
# if r < t:
#     print(r)
# elif t < r:
#     print(t)
# #. Перевіримо, чи введене число знаходиться в діапазоні [-4;10]:
# z = int(input())
# if z >= -4 and z <= 10:
#     print("z,Число в диапазони")
# # Є 3 цілих числа. Знайти кількість додатніх чисел і надрукувати результат.
# f = int(input())
# j = int(input())
# q = int(input())
# if f == j == q:
#     print("3")
# elif f == j or f== q or q == j:
#     print("2")
# else:
#     print("1")
# # 5. Дано три цілих числа. Визначте, скільки серед них таких, що збігаються. Програма
# u = int(input("Введіть перше число: "))
# g = int(input("Введіть друге число: "))
# b = int(input("Введіть третє число: "))
# if u == g == b:
#     print("3 Числа однакові")
# elif u == g or u == b or g == b:
#     print("2 Числа однакові")
# else:
#     print("Всі числа різні")
# #7. Вводиться дійсне число. Потрібно визначити, що його ціла частина кратна 2.
# m = float(input("Введіть дійсне число: "))
# m = int(m)
# print("Число кратна 2:", m % 2 == 0)
# #4. Вивести на екран числа від -10 до 10 за допомогою циклу while
# h = -10
# while h <= 10:
#     print(h)
#     h += 1
# #12. Вводяться два цілих числа. Визначити, чи діляться вони націло одне на одне.
# j = int(input("Введіть перше число: "))
# l = int(input("Введіть друге число: "))
# if l == 0:
#     print("Ділити на нуль неможливо")
# else:
#     if j % l == 0:
#         print("Діляться")
#     else:
#         print("Не діляться")
#     print("Результат ділення:", j / l)