# # pip install streamlit

# import streamlit as st 


# st.title("Перший стрімліт") # Великий текст , заголовок
# st.write("Привіт це маленький текст") # Маленький звичайний текст

# #Базові елементи інтерфейсу
# # Заголовок
# st.title("Заголовок") # Найбільший заголовок на сайті
# st.header("Заголовок 2 рівня") # Другий за розміром заголовок
# st.subheader("Заголовок 3 рівня") # Третій за розміром заголовок

# # тексти 
# st.write("Це звичайний текст") # Звичайний текст
# st.markdown("Жирний текст") # Жирний текст  Дві зірочки
# st.markdown("*Курсивний текст*") # Курсивний текст * одна зірочка
# st.markdown("~~Закреслений текст~~") # Закреслений текст ~~ дві тильди
# st.markdown("[Посилання на Google](https://www.google.com)") # Посилання
# st.markdown("`Кодовий текст`") # Кодовий текст ` одна зворотна апострофа

# #Вставка коду 
# st.code("""# pip install streamlit

# import streamlit as st 


# st.title("Перший стрімліт") # Великий текст , заголовок
# st.write("Привіт це маленький текст") # Маленький звичайний текст

# #Базові елементи інтерфейсу
# # Заголовок
# st.title("Заголовок") # Найбільший заголовок на сайті
# st.header("Заголовок 2 рівня") # Другий за розміром заголовок
# st.subheader("Заголовок 3 рівня") # Третій за розміром заголовок

# # тексти 
# st.write("Це звичайний текст") # Звичайний текст
# st.markdown("**Жирний текст") # Жирний текст ** Дві зірочки
# st.markdown("*Курсивний текст*") # Курсивний текст * одна зірочка
# st.markdown("~~Закреслений текст~~") # Закреслений текст ~~ дві тильди
# st.markdown("[Посилання на Google](https://www.google.com)") # Посилання
# st.markdown("`Кодовий текст`") # Кодовий текст ` одна зворотна апострофа
# """, language="python")


# # Формули 
# st.write("Формули можна писати в форматі LaTeX")
# st.write("E=mc^2") # Звичайний текст
# st.latex("E=mc^2") # Формула в форматі LaTeX

# st.image("https://www.python.org/static/community_logos/python-logo.png", width=200) # Вставка зображення з інтернету
# #st.image("local_image.png", caption="Локальне зображення") # 

# # Розмежувач 
# st.divider() # Горизонтальна лінія для розмежування контенту

# st.info("ℹ️ Це інформація")
# st.success("✅ Успіх!")
# st.warning("⚠️ Увага!")
# st.error("❌ Помилка!")

# # Створення кнопки 
# button1 = st.button("Натисни мене")
# #Щоб зробити дію для кнопки ми кажемо
# if button1:
#     st.write("Ви натиснули кнопку!")

# # поле введення тексту
# name = st.text_input("Введіть ваше ім'я")
# if name: # Спрацює тоді коли ми натиснули Enter або коли ми клікнемо поза полем вводу
#     st.write(f"Привіт, {name}!")

# # Слайдер 
# age = st.slider("Вік",0,100,30,1) # Слайдер для вибору віку від 0 до 100 з кроком 5 і початковим значенням 30
# st.write("Ваш вік: ", age)

# # Чекбокс
# if st.checkbox("Показати секретний текст"):
#     st.write("Секретний текст: Python - найкраща мова програмування!")

# # Радіо кнопка 
# color = st.radio("Виберіть колір", ("Червоний", "Зелений", "Синій"))
# st.write("Ви вибрали: ", color)


# Завдання 2: "Конвертер валют" (Легко) 

# Поле введення суми (UAH) → checkbox "USD/EUR/GBP" → виводь конверсію (можна з фіксованими курсами).



import streamlit as st 
st.title("Конвертер валют")

uah1 = 0
uah = st.number_input("Введіть суму у гривнях:", min_value=1, step=1)
currency = st.radio("Виберіть валюту:", ("USD", "EUR", "GBP"))

if currency == "USD":

    uah1 = uah / 44.27
    st.write(uah1)

elif currency == "EUR":

    uah1 = uah / 51.33
    st.write(uah1)

elif currency == "GBP":

    uah1 = uah / 59.40
    st.write(uah1)
