# Проєкт: "Рахувальник Слів"
# Умова: Напиши програму, яка просить користувача ввести одне речення. Після цього програма має порахувати і сказати, скільки всього символів і скільки окремих слів у цьому реченні.
# А ще, давай додамо "секретне слово"! Якщо в реченні є слово "привіт" (або "Привіт"), програма має написати: "Я теж радий тебе бачити!"
# Користувач вводить: Привіт, як твої справи?
# Програма має вивести: У твоєму реченні 24 символів. У твоєму реченні 4 слів. Я теж радий тебе бачити!
# Підказка: Метод .split() робить з речення список слів.
# Щоб порахувати символи, тобі потрібна функція len()
# Щоб знайти "секретне слово", тобі треба перевірити, чи є воно в тексті.
# Тобі потрібен if, щоб перевірити, чи є в тексті "секретне слово".
# if "привіт" in text:

# g = None
# d = None
# a = input("Введіть слово: ")
# d = len(a)
# g = a.split()
# h = len(g)
# if "привіт" or "Привіт" in a:
#     print("Привіт, як твої справи?")
# print(f"У твоєму речені {d} символів")
# print(f"У твоєму речені {h} слів")

# Проєкт: "Орел чи Решка"
# Умова: Напиши програму, яка "підкидає" віртуальну монетку.
# Програма має випадковим чином вирішити,
# що випало — "Орел" чи "Решка" — і повідомити про це користувача.

# import random

# d = input("Введіть орел чи решка: ").lower()

# a = random.choice(["орел","решка"])

# if a == d:
#     print("Ви вгадали")
# else:
#     print("Ви не вгадали")

# if a == "Орел":
#     print(f"Випал {a}")
# else:
#     print(f"Випала {a}")

# Проєкт: "Кидок Кубика"
# Умова: Напиши програму,
# яка "кидає" гральний кубик (той, що має 6 сторін з числами від 1 до 6).
# Програма має випадковим чином обрати число від 1 до 6 і показати результат користувачеві.

# import random

# g = int(input("Введіть число від 1 до 6"))

# a = random.randint(1,6)

# if g == a:
#     print("Ви вгадали")
# else:
#     print("Ви не вгадали")

# print(f"Випало число {a}")

# print(a)

# Проєкт: "Генератор Паролів"
# Умова: Напиши програму, яка генерує випадковий, надійний пароль.
# Програма повинна спершу запитати у користувача, якої довжини має бути пароль. Потім вона має згенерувати пароль,
# який складається з випадкового набору малих літер, великих літер, цифр та спеціальних символів.

import random

e = None
paroli = None

a = int(input("Яка довжина пароля потрібно придумати: "))

letters_lower = 'abcdefghijklmnopqrstuvwxyz' 
letters_upper = 'ABCDEFGHIJKLMNOPQRSTUVWXYZ' 
numbers = '0123456789' 
symbols = '!@#$%^&*()_+'

b = letters_lower + letters_upper + numbers + symbols

b = list(b)

for g in range(a):
    e = random.choice(b)
    paroli += e

print(paroli)