# 1. Дано два цілих числа. Виведіть значення найменшого з них.

# a1 = int(input("Введіть перше число: "))
# a2 = int(input("Введіть другоге число: "))
# if a1 > a2:
#     print(a2)
# elif a2 > a1:
#     print(a1)

# 4. Знайти суму всіх парних чисел від 1 до n. (n - input)

# n = int(input("Введіть число: "))
# i = 2
# while i <= n:
#     i += 2
# print(i)

# 13. Знайти суму непарних чисел від 1 до 1001:

# suma = 0
# for i in range(1, 1002, 2):
#     suma += i
# print(f"Сума непарних чисел від 1 до 1001 {suma}")

# Через input вводитсья рядок. Порахувати кількість маленьких букв у ньому. (функція .islower())

# text = input("Введіть рядок: ")
# h = 0
# for a in text:
#     if a.islower():
#         h += 1
# print(f"Кількість маленьких букв у рядку: {h}")

# 1. Дано список [-1, 0, 5, 3, 2]. Необхідно змінити його, збільшивши кожне значення на 7.2.

# numbers = [-1, 0, 5, 3, 2]

# numbers1 = []
# for a in numbers:
#     numbers1.append(a + 7.2)

# print(f"{numbers1}")

# 4. Футболка: напишіть функцію make_shirt(), яка отримує розмір футболки та текст,
# який має бути надрукований на ній. Функція має виводити повідомлення з
# розміром і текстом.

# a = int(input("Введіть розмір футболки: "))
# d = str(input("Введіть текст на футболке: "))
# def g (a,d):
#     print(f"Розмір {a} текст {d}")
# g(a,d)

# 2. Задано кількість годин та хвилин. Використовуючи вкладений умовний оператор,
# перевірити, чи введені години та хвилини є допустимими значеннями. Якщо так,
# вивести повідомлення "Введений час є допустимим."

minute = int(input("Введіть хвилини: "))
hour = int(input("Введіть час: "))
if 0 <= minute <= 60 and 0 <= hour < 24:
    print("Час є допустим")
else:
    print("Час не є допустим")
