# Умова:
# Уяви, що ти пекар і у тебе є піч, яка випікає піцу за певну кількість хвилин. Потрібно написати функцію, яка відлічує хвилини до готовності піци.
# Що треба зробити:
# Створити функцію bake_pizza(minutes), яка приймає один аргумент — скільки хвилин залишилося до готовності піци.
# Використати цикл while, який працює, поки minutes більше 0.
# На кожній ітерації виводити:
# До готовності піци залишилось X хвилин...
# і зменшувати minutes на 1.
# Коли час закінчиться, вивести:
# Піца готова!
# def bake_pizza(minutes):
#     while 0 < minutes:
#         minutes -= 1
#         print("До готовності піци залишилось",minutes,"хвилин")
#     print("піца готова")
# bake_pizza(60)

# Напиши функцію jungle_animal(animal), яка приймає назву тварини як рядок.
# Якщо тварина — "лев", програма виводить "Це цар звірів! ".
# Якщо тварина — "мавпа", виводить "Це пустунка з джунглів! ".
# Якщо тварина — "папуга", виводить "Це яскравий балакун! ".
# Якщо передано будь-яку іншу тварину, виводить "Незнайомець у джунглях!".
# def jungle_animal(animal):
#     if animal == "лев":
#         print("Це цар звірів")
#     elif animal == "мавпа":
#         print("Це пустунка з джунглів")
#     elif animal == "папуга":
#         print("Це яскравий балакун")
#     else:
#         print("Незнайомець у джунглях")
# jungle_animal("мавпа")

#                Домашка

# Напиши функцію weather_advice(temp), яка приймає температуру в градусах Цельсія.

# Якщо температура більше або дорівнює 25 — вивести "Сьогодні спекотно! Візьми сонцезахисні окуляри".

# Якщо температура від 15 до 24 включно — вивести "Чудова погода для прогулянки".

# Якщо температура від 0 до 14 включно — вивести "Прохолодно, одягнися тепліше".

# Якщо температура нижче 0 — вивести "Мороз! Краще залишайся вдома".


# def weather_advice(temp):
#     if temp >= 25:
#         print("Сьогодні спекотно! Візьми сонцезахисні окуляри")
#     elif 15 <= temp <= 24:
#         print("Чудова погода для прогулянки")
#     elif 0 <= temp <= 14:
#         print("Прохолодно, одягнися тепліше")
#     else:
#         print("Мороз! Краще залишайся вдома")
# weather_advice(20)

# Напиши функцію ticket_price(age), яка приймає вік людини.

# Якщо вік менше 6 років — квиток безкоштовний, вивести "Вхід безкоштовний".

# Якщо вік від 6 до 17 включно — ціна квитка 50 грн, вивести "Квиток коштує 50 грн".

# Якщо вік від 18 до 64 включно — ціна квитка 100 грн, вивести "Квиток коштує 100 грн".

# Якщо вік 65 і більше — ціна квитка 70 грн, вивести "Квиток коштує 70 грн".

# def ticket_price(age):
#     if age < 6:
#         print("Вхід безкоштовний")
#     elif 6 <= age <= 17:
#         print("Квиток коштує 50 грн")
#     elif 18 <= age <= 64:
#         print("Квиток коштує 100 грн")
#     elif age >= 65:
#         print("Квиток коштує 70 грн")
# ticket_price(16)

# Напиши функцію speed_check(speed), яка приймає швидкість автомобіля в км/год.

# Якщо швидкість менше або дорівнює 50 — вивести "Все добре, їдь спокійно".

# Якщо швидкість від 51 до 90 — вивести "Будь уважним, не перевищуй".

# Якщо швидкість більше 90 — вивести "Перевищення швидкості! Поліція вже в дорозі".

# def speed_check(speed):
#     if speed <= 50:
#         print("Все добре, їдь спокійно")
#     elif 51 <= speed <= 90:
#         print("Будь уважним, не перевищуй")
#     elif speed > 90:
#         print("Перевищення швидкості! Поліція вже в дорозі")
# speed_check(53)