# 4. Створіть програму, яка обчислює квадратний корінь з введеного користувачем числа.  
# Виведіть повідомлення про помилку, якщо користувач вводить від'ємне число.  

# A = int(input("Введіть число: "))  
# try:  
#     print(A**2)  
# except TypeError:  
#     print("Ошибка")


# 5. Напишіть програму, яка запитує користувача про його вік. Використайте try-except для      
# перехоплення помилки, якщо користувач вводить нечислове значення або вік, який      
# не відповідає реальності.      

# A = int(input("Введіть вік: "))      
# try:      
#     if 0 <= A <= 100:      
#         print("Коректний вік")      
# except ValueError:      
#     print("Вік не кореткний")


# 7. Напишіть програму, яка зчитує ім'я користувача та вітає його. Обробте виключення,    
# якщо користувач не вводить ім'я, або вводить некоректні символи.    
# Результат вивести на екран (без лапок).    

# A = str(input("Введіть своє ім'я: "))    
# try:    
#     if not  A.isalpha():    
#         raise ValueError("Некоректне ім'я.")    
#     print(f"Поздровляю в днем рождением {A}")    
# except ValueError as ve:    
#     print("Помилка:", ve)


# 3. Напишіть функцію, яка приймає рядок та повертає цей рядок у верхньому регістрі.
# Використайте блок try-except для перехоплення помилки, якщо аргументом є не рядок.

# def text_up(text):      
#     try:      
#         return text.upper()      
#     except AttributeError:      
#         print("Error 72")


# 8. Реалізуйте функцію, яка приймає список чисел та знаходить їх середнє арифметичне.
# Використайте try-except для обробки можливих помилок при введенні нечислових значень.

# def calculate_average(input_list):
#     try:
#         total = 0
#         count = 0
#         for i in input_list():
#             total += i
#             count += 1
#     except ValueError, TypeError:
#         average = calculate_average(input_list)
#     if average is not None:
#         print("Середнє арифметичне:", average)


# Приклад виклику функції:
# input_list = [2, 4, '5', 10]
# average = calculate_average(input_list)
# if average is not None:
#     print("Середнє арифметичне:", average)

#                  Домашка

# 9. Створіть програму, яка зчитує рядок та розділяє його на слова.
# Виведіть слова, які мають довжину більше 5 символів.
# Обробіть виключення, якщо рядок містить некоректні символи.

s = input("Введіть рядок: ")
try:
    d = s.split(" ")
    for a in d:
        if len(a) > 5:
            print(a)
except:
    print("Помилка: некоректний рядок") 