# 5. Вгадай улюблений колір 🎨
# Користувач вводить колір.
# Якщо це "синій" → «Це теж мій улюблений колір!».
# Інакше → «Цікавий вибір!».

# kolip = int(input("Введіть свій улюблений колір"))
# if kolip == "синій":
#     print("Це теж мій улюблений колір")
# else:
#     print("Цікавий вибір")

# Що таке input?
# input дозволяє нам вводити з клавіатури або ж в консолі будь які значення
# Усе що ввів користувач(включаючи пробіли на початку і в кінці ) Повертає завжди рядок, тобто STR формат інакше кажучи стрінг 
# Ми не можемо використовувати input без присвоєння його якійсь змінній 
# input("Hello!") - ✖️✖️✖️✖️✖️✖️✖️✖️
# a = input("Hello!") - ♥️♥️♥️♥️♥️♥️♥️♥️ Правильний варіант
# name = " Max "
# name2= "Max"
# print(name)
# print(name2)
# print(name == name2) # False
#Пробіли враховуються і 2 однакових рядка з різними пробілами не дорівнюються 
# Перетворення типів данних для input
# int() float() str() 
# int() -  цілі числа (1,2,3,4,5,6,7,8,9,10)
# float() -  дробові числа (1.1,2.2,3.3,4.4,5.5,6.6,7.7,8.8,9.9,10.10) - Роздільний знак завжди є крапка
# str() -  рядки ("Max", "Max", "Max") - ЗАпам'ятайте все що в лапках це рядок і формат STR 

# # Лайфхак для дробових чисел 
# s = input("ціна").replace(",", ".") # для тих хто привик писати дробові числа через кому
# print(float(s))
# print(type(float(s)))

# 
# Очищення та нормалізація
# =======================Нам корисно рядки перед перевірками
# .strip() - видаляє пробіли на початку і в кінці
# .lower() - робить літери маленькими
# .upper() - робить літери великими
# .replace("a", "b") - замінює "a" на "b"
# .capitalize() - робить першу літеру великою
# while True:
#     answer = input("свято (так чи ні):").strip().lower()
#     if answer == "так":
#         print("Наші методи очистки і нормалізації працюють")

#Перевірка введення - надійно і по-людськи
# while True:
#     s=input("Введіть ціле число ").strip()
#     try:
#         n = int(s)
#         print("Все чудово")
#         break
#     except ValueError:
#         print("Це не ціле число. Спробуйте ще раз")


# 1. Привітання 👋

# Умова:
# Запитайте у користувача його ім’я і виведіть повідомлення:

# name = input("Введіть своє ім'я ")
# print(f"Привіт {name} !!!")
# print("Привіт", name +" "+"!!!")
# #f - форматований рядок, який дозволяє нам вставляти змінні прямо в лапки за допомогою таких дужок {}

# 2. Подвоєне число ✖️2

# Умова:
# Запитайте у користувача число і виведіть його подвоєне значення.

# a = int(input("ВВедіть число "))
# print(f"Подвоєне число {a*2}")


# 3. Вік і рік народження 📅

# Умова:
# Запитайте у користувача його вік і виведіть приблизний рік народження (вважаємо, що зараз 2025 рік).

# age = int(input("Скільки тобі років? "))
# year = 2025 - age
# print(f"Ти народився приблизно у {year} році ")

# Задача. Точний рік народження 🗓️
# Користувач вводить свій вік.
# Далі програма запитує, чи був у нього вже день народження цього року (відповідь "так"/"ні").
# Якщо був → рік народження = поточний рік – вік.
# Якщо ще не був → рік народження = поточний рік – вік – 1.
# Вважати, що зараз 2025 рік.

# age = int(input("Скільки тобі років? "))
# while True:
#     print("Чи було у тебе цього року день народження")
#     a = input("").strip().lower()
#     if a == "так":
#         g = 2025 - age
#         print(g)
#         break
#     if a == "ні":
#         g = 2024 - age
#         print(g)
#         break
#     else:
#         print("Введіть кореткно (спробуйте ще раз)")

# 2) 📚 Бібліотека
# Користувач вводить:
# ім’я читача,
# назву книги,
# кількість днів для оренди.
# Якщо днів ≤ 14 → "Книга видана без штрафу".
# Інакше → "Потрібно оплатити штраф: X грн" (1 грн за кожен день понад 14).

# Name = input("ім’я читача: ")
# Knuga = input("назву книги: ")
# Day = int(input("кількість днів для оренди: "))
# if Day <= 14:
#     print("Книга видана без штрафу")
# else:
#     x = Day - 14
#     print(f"Потрібно оплатити штраф: {x} грн")