#1.Скільки осталось бегать без остоновки до мирового рекорда
a = int(input("Введіть скільки ти прибіг метров за день без остановки " ))
x = 170300
i = 0
while x > a :
    x-=a
    s=x
    print("До мирового рекорда осталось",s,"м")
    i += 1
print("ви бігали ",i,"днів")
#Сколько дней надо пригать в геотридаш чтоби побить 
#мировой рекорд прижков за все время
a = int(input("Сколько ти раз пригаешь в геотридаш за день "))
x = 197378825
o = 0
while x>a:
    x -=a
    s = x
    print("до мирового рекорда осталось" ,s,"прижков")
    o +=1
print("Ти пригав",o,"днів")