# # Оператори 
# # ----- Арифметичні оператори ------ 
# # + - * / 
# # % 
# a = 10
# b = 3
# print(a % b)
# # ** Піднесення до степеня 
# a = 2
# b = 3
# print(a ** b)
# # Цілочисельне ділення //
# a = 10
# b = 3

# print(a // b)
# a = int(input("Введи число "))
# b = float(input("Введи число "))
# print(type(a))
# print(type(b))
# print(a-b)

# ----- Оператори присвоєння ----- 
# = Призначити значення змінній 
# += Додавання значення з правого боку до лівої частини і потім призначити значення суми  
# a = 10
# a += 5
# print(a)
# # -= Віднімання значення з правого боку до лівої частини і потім призначити значення різниці
# a = 6
# a -= 2
# print(a)
# # *= Помноження значення з правого боку до лівої частини і потім призначити значення добутку
# a = 2
# a *= 3
# print(a)
# # /= Ділення значення з правого боку до лівої частини і потім призначити значення частки
# a = 10
# a /= 2
# print(a)
# #. // Ділення значення з правого боку до лівої частини і потім призначити значення частки
# a = 10
# a //= 4
# print(a)
# # % Ділення з часткою та присвоєння 
# a = 10
# a %= 3
# print(a)
# # ** Піднесення до степеня
# a = 2
# a **= 3
# print(a)
# # ----- Оператори порівняння -----  Використовуються для створення умов 
# # == Рівність або дорівнює до якого ми звикли 
# # != Нерівність
# # > Більше
# # < Менше
# # >= Більше або рівне
# # <= Менше або рівне
# # Bool? True False  усі оператори порівняння несуть в собі True або False 
# a = 10
# b = 10
# print(a == b)
# print(a != b)
# print(a > b)
# print(a < b)
# print(a >= b)
# print(a <= b)
# ----- Логічні оператори -----  Використовуються для створення умов 
# and логічне і 
# or логічне або
# not логічне ні 
# a = True
# b = False
# print(a and b)
# print(a or b)
# print(not a)
# # - 2 до 5 включно 
# y = 1.95
# print(y>=-2 and y<=5)

# # Оператор in - використовується для перевірки на наявність Використовує True або False 
# a = "Hello, World!"
# print("Hello" in a)
# # print("Python" in a)

# # ----- Функція round -----
# a = 3.141592653589793
# print(round(a, 2))

n = float(input(""))
print(int(n) % 3 == 0)

a = int(input(""))
s = int(input(""))
d = int(input(""))
f = a - s - d
print (f)

a = float(input(""))
print(int(a) % 2 == 0)

