#STR - string рядок , будь який текст в лапках 
#a="івроапгуралрацушгаррцла478236247612876юююлждлжі{dkdghjkfdh}[329423858]"
#print(type(a))
# Int - integer будь які ЦІЛІ числа 
#b = 10
#print (type(b))

#Float - будь які ДРОБОВІ числа 
#c = 13.5 
#print (type(c))

# BOOL - логічний тип даних який має 2 значення True або False
#d = True 
#print(type(d))

# Список  
#e = ['1',"BMW","Mr Crabs"]
#print(type(e))

# Словник 
#f = {"tik":"tok"}
#print(type(f))

# Tuple - кортеж 
#g = (1,2,3,4,5)
#j = 1,2,3,4,5
#h = tuple() # порожній кортеж 
#k = 1, # кортеж з одного елементу 
#print(type(g))
#print(type(j))
#print(type(h))
#print(type(k))

# a = 600,400 # кортеж з двох елементів
# print(a)
# print(a[0])
# print(a[1])
# print(len(a))
# b = a[0]
# print(b)
# c = a[1]
# print(c)
# # додавання елементів в кортеж 
# t = (1,2)
# t = t + (3, )
# print(t)
# # Кортеж може в собі містити різні типи даних 
# t = (1,2,"Hello",True,3.14)
# print(t)

# # Функції кортежів 
# t = (1,2,3,4,5,2,2,2,2)
# print(t.count(2)) # скільки разів зустрічається елемент 
# print(t.index(2)) # індекс елемента 

# Завдання:
# Ввести числа з клавіатури і додати їх у кортеж
# t = (3,4,5,-4)
# nums = tuple(map(int,input("Введіть числа через пробіл: ").split()))
# print(nums)
# print(t+nums)

# Множини : - set 
# set - це невпорядкована множина унікальних елементів 

# s = { 1 , 3 ,67 ,67, 67 ,67 ,67 ,67 ,67  }
# print(s)
# print(type(s)) 
# # Для створення множини використовується функція set()

# s = set() 
# print(s)
# print(type(s))
# # ЗВЕРНІТЬ УВАГУ 
# s = {} # це порожній словник НЕ МНОЖИНА 
# print(s)
# print(type(s))

# # Множина може містити різні типи даних 
# s = {1,2,3,4,5,6,7,8,9,10,"Hello",True,3.14}
# print(s)
# print(type(s))

# # Перевірка наявності елемента в множині 
# #за допомогою оператора in або not in 
# s = {1,2,3,4,5,6,7,8,9,10,"Hello",True,3.14}
# print(2 in s) # True
# print(2 not in s) # False 

# # Додавання елементів в множину 
# s.add(11)
# print(s)
# # Додавання кількох елементів в множину 
# s.update([12,13,14,15])
# print(s)
# # Видалення елементів з множини 
# s.remove(11) # якщо елемента немає в множині то буде помилка 
# print(s)
# # Видалення елементів з множини  без помилки 
# #якщо елемента немає в множині то помилки не буде 
# s.discard(12)
# print(s)
# # Видалення випадкового елемента з множини 
# s.pop() # видаляє випадковий елемент 
# print(s)
# # Видалення всіх елементів з множини 
# s.clear() # видаляє всі елементи з множини 
# print(s)
# # Видалення множини 
# del s # видаляє множину 
# print(s)

# a = {1,2,3,4}
# b = {3,4,5}  
# print(a.intersection(b)) # перетин множин 
# print(a.union(b)) # об'єднання множин 
# print(a.difference(b)) # різниця множин 
# print(a.symmetric_difference(b)) # симетрична різниця множин 
# print(a.issubset(b)) # перевірка на підмножину 
# print(a.issuperset(b)) # перевірка на надмножину 
# print(a.isdisjoint(b)) # перевірка на неперетинність