#Цей код створює Міні-калькулятор,
#який дозволяє користувачеві виконувати прості арифметичні операції -
#додавання, віднімання, множення та ділення з двома числами.
#Користувач може вибрати бажану операцію, ввести два числа, і результат операції буде виведений на екран.
#Також є опція "Exit" (вихід) для того, щоб користувач міг завершити роботу з калькулятором.
while True:
    print("1.Додати")
    print("2.Відняти")
    print("3.Помножити")
    print("4.Поділ")
    print("5.Виход")
    a = int(input("Виберить операцію "))
    f = int(input("Введіть начальне число "))
    d = int(input("Введіть число "))
    if a == 2:
        g = f - d
    elif a == 3:
        g = f * d
    elif a == 4:
        if d == 0:
            print("Помилка")
        else:
            g = f / d
    elif a == 1:
        g = f + d
    elif a == 5:
        break
    else:
        print("Введіть коректне число")
    print(g)