# # Щоб створити список використовуються [ . . . . . ]
# cars = ["Alfa Romeo","Volvo","BMW","Toyota"] 
# print(cars) # ['Alfa Romeo', 'Volvo', 'BMW', 'Toyota']
# # Щоб створити пустий список ми пишемо
# a = []

# # Інші види списків 
# weekdays = ["Monday","Friday","Wednesday"]
# animals = ["bats","elephants","bears",5,10,40,540]
# numbers = [5,10,15,20,25]
# команда list для того щоб розбити слово на символи в списку 
# while True:
#     spusok = list(input())
#     print(spusok)
# spusok = ['H', 'e', 'l', 'l', 'o', ' ', 'W', 'o', 'r', 'l', 'd']
# .split() викорстовується для записуваня значень в список через пробіл формат str 
# Odin Dva Tri 
# ['Odin', 'Dva', 'Tri']
# while True:
#     spusok = input().split(",") # в дужках вводимо свій роздільник який ми хочемо викорстовувати замість пробілу 
#     print(spusok)

# .append() використовується щоб додати елемент до списку 
# list1=[]
# for i in range(10):
#     list1.append(int(input()))
# print(list1)

# list1=['H', 'e', 'l', 'l', 'o', ' ', 'W', 'o', 'r', 'l', 'd']
# for i in range(5):
#     list1.append(input())
# print(list1)

# Генератори списків 

# N=6
# a = [0] * N

# for i in range(N):
#     a[i]=i**2
#     print(i)
# print(a)

# [<спосіб формування значення> for <змінна> in <об'єкт, що ітерується>].

# N=5
# a = [x**2 for x in range(N)]
# print(a)

# a = [x % 4 for x in range(N)]
# print(a)
# a= [x % 2 == 0 for x in range(N)]
# print(a)
# a = [0.5*x+1 for x in range(N)]
# print(a)


# Функції в списках 

# cars = ["Alfa Romeo","Volvo","BMW","Toyota"] 
# cars[1] = "Mercedes"
# print(cars)
# numbers = [10,30,2,5,130,6]
# print(list('sun'))
# print(sum(numbers)) # sum викорстовується для підрахунку загальної суми усіх елементів в списку 
# print(max(numbers)) # max - знаходить максимальний елемент (самий більший )
# print(min(numbers)) # min - знаходить мінімальний елемент (самий менший )
# print(sorted(numbers)) # [2, 5, 6, 10, 30, 130] сортує правильно список (від меншого до більшого)
# print(sorted(cars)) # ['Alfa Romeo', 'BMW', 'Mercedes', 'Toyota'] сортує по алфавіту 

# Можливості роботи з списками

# nums = [1,2,3]
# nums1 = [4,5,6]
# print(sorted(nums1 + nums)) # [4, 5, 6, 1, 2, 3] , sorted - [1, 2, 3, 4, 5, 6]

# # дублювання списків 

# list1 = ["hello","world"]
# print(list1 * 5) # ['hello', 'world', 'hello', 'world', 'hello', 'world', 'hello', 'world', 'hello', 'world']

# print("python" in list1) # False - знайти чи є цей елемент в списку 

# Сортування (детальніше)

# words = ["apple", "banana", "cherry", "date"]
# print(words[3])
# sorted1 = sorted(words, key=len)
# print(sorted1) # ['date', 'apple', 'banana', 'cherry']



# print(len(words)) # Кількість елементів в списку ---- 4

# 1. Дано список [-1, 0, 5, 3, 2]. Необхідно змінити його, збільшивши кожне значення на 7.2.
# a = [-1, 0, 5, 3, 2]
# b=[]
# for i in a:
#     i+=7.2
#     print(i)
#     b.append(i)
# print(b)

# 2. Користувач вводить з клавіатури числа, доти, доки не введе число 0. На основі
# введених даних потрібно сформувати список, що складається з квадратів введених
# чисел. --------- квадрат числа a ** 2
# a = int(input("Введіть число"))
# if a == 0:
# while True: 
# .append(a**2)
# b = []
# while True:
#     a = int(input("Введіть число "))
#     if a == 0:
#         break   
#     b.append(a**2)
# print(sorted(b))

# # 7. Є список числа переглядів відео за днями:
# # v = [1205, 1101, 1434, 1320, 923, 874]
# # Необхідно вибрати з нього перші три значення (використовуючи зрізи) і вивести
# # результат на екран.

# v = [1205, 1101, 1434, 1320, 923, 874]
# print(v[:3])


# 8. Є список числа переглядів відео за днями:
# v = [1205, 1101, 1434, 1320, 923, 874]
# Необхідно вибрати з нього останні чотири значення (використовуючи зрізи) і вивести
# результат на екран.

# v = [1205, 1101, 1434, 1320, 923, 874]
# print(v[-4:])

# 9. Є список міст:
# c = ["Київ", "Харків", "Суми", "Одеса", "Чернігів", "Луганськ", "Донецьк"]
# Необхідно за допомогою зрізів вибрати з нього міста через один (починаючи з першого) і
# результат вивести на екран.
# c = ["Київ", "Харків", "Суми", "Одеса", "Чернігів", "Луганськ", "Донецьк"]
# print(c[::2])

# 2. Користувач вводить з клавіатури числа, доти, доки не введе від'ємне число,  На основі
# введених даних потрібно сформувати список, що складається з кубів введених
# чисел.

# b = []
# while True:
#      a = int(input("Введіть число "))
#      if a < 0:
#          break   
#      b.append(a**3)
# print(sorted(b))





# 1. Вводяться назви міст в один рядок через пробіл. На основі цього рядка
# необхідно створити список lst і додати його в кінець наступного списку:
# cities = ["Київ", "Суми", "Харків"]

# cities = ["Київ", "Суми", "Харків"]
# a = int(input("Введіть число "))
# a.append(cities)
# print(cities)

# 2. c = ["Київ", "Харків", "Суми", "Одеса", "Чернігів", "Луганськ", "Донецьк"]
# Необхідно за допомогою зрізів вибрати з нього міста через один (починаючи з
# другого) і результат вивести на екран.

# c = ["Київ", "Харків", "Суми", "Одеса", "Чернігів", "Луганськ", "Донецьк"]
# print(c[1::2])

# 3. m = [2, 3, 5, 5, 2, 2, 3, 3, 4, 5, 4, 4]
# Необхідно за допомогою зрізів вибрати елементи
# з 3-го по 7-й (включно) і вивести їх на екран у зворотному порядку.

# m = [2, 3, 5, 5, 2, 2, 3, 3, 4, 5, 4, 4]
# g = (m[2:6])
# print(g[::-1])