# str1 = "Hello"
# str2 = "World"
# str3 = """Hello
# zdsd
# dfefkw
# grjfkjw
# gjfjkwefnjkwe
# djfwekfwejkfbn
# World""" 
# str4 ='''
# print(str3)
# print(type(str1))
# print(type(str2))
# '''
# str5 = str1 + " " + str2 
# print(str5)

# a= "5"
# b= "5"
# print(a+b)

# a = "ой"
# print(a*100) # Множити можна лише на цілі числа 
# ----------------------------- Функція len() --------------------------------
#len() # Ця функція дозволяє нам дізнатись кількість символів в рядку
# a = "Bibi"
# b = len(a)
# print(b)
# print(type(b))
# if b < 8 :
#     print("Пароль закороткий")

# # ----------- Оператор in ----------------
# s = "abcdefg0123"
# print("@ , # < % & * " in s)
# if "@ , # < % & * " not in s:
#     print("немає спецсимволів")


# ============================ H E L L O Індекси ==============================
# Перша буква має індекс 0 [0]
#Остання буква має індекс [-1]
# a = "Іван"
# b = "Іванович"
# print(a[0],".",b)


# ======================== Зрізи ======================

# #msg = "Hello World! 32532523e32e8923745982345"
# msg = "Hello World!"
# print(msg[6:11]) # World
# print(msg[2:5]) # llo
# print(msg[:5]) # Hello
# print(msg[6:]) # World! 32532523e32e8923745982345
# print(msg[:]) #  Hello World! 32532523e32e8923745982345
# print(msg[-5:-1]) # 8234
# print(msg[1:9:2]) # Перший індекс , останній індекс , крок 
# print(msg[1:-9:-1])
# print(msg[::-1]) # Перевернутий рядок  !dlroW olleH

#==========================Методи рядків===============================
# a = "Hello World!"
# a.upper()
# print(a)
# b = a.upper()
# print(b)
# c = b.lower()
# print(c)
# d = input().lower()
# print(d)
# print(" Напишіть так якщо погоджуєтесь з нашими правилами")
# a=input().capitalize()
# print(a)
# if a == "Так":
#     print("Вітаю! ви погодились")

# msg = "abrakadabra"
# b= msg.count("ra")
# print(b)
# print(type(b))

# 3. Напишіть програму визначення слова паліндрома (це слова, що однаково читаються
# в обох напрямках, наприклад, анна, abba тощо). Слово вводиться з клавіатури.
# a = (input("")).lower()
# f = (a[::-1])
# if a == f:
#     print("Так")
# else:
#     print("Ні")

#----------------------Домашка----------------------------

# 2. Напишіть програму введення двох рядків (кожен вводиться з нового рядка) і
# їх об'єднання в один рядок через пробіл.

# l = input("")
# d = input("")
# q = l + " " + d
# print(q)

# 3. Написати програму введення рядка і формування нового рядка вигляду:
# "Рядок: <введений рядок>. Довжина: <довжина рядка>". Результат сформованого
# рядка вивести на екран.

# l = input("")
# d = len(l)
# print("Рядок:", l, ".Довжина", d)
# 1. Дано список [-1, 0, 5, 3, 2]. Необхідно змінити його, збільшивши кожне значення на 7.2.
# a = [-1, 0, 5, 3, 2]
# b=[]
# for i in a:
#     i+=7.2
#     print(i)
#     b.append(i)
# print(b)

# 2. Користувач вводить з клавіатури числа, доти, доки не введе число 0. На основі
# введених даних потрібно сформувати список, що складається з квадратів введених
# чисел. --------- квадрат числа a ** 2
# a = int(input("Введіть число"))
# if a == 0:
# while True: 
# .append(a**2)
# b = []
# while True:
#     a = int(input("Введіть число "))
#     if a == 0:
#         break   
#     b.append(a**2)
# print(sorted(b))

# # 7. Є список числа переглядів відео за днями:
# # v = [1205, 1101, 1434, 1320, 923, 874]
# # Необхідно вибрати з нього перші три значення (використовуючи зрізи) і вивести
# # результат на екран.

# v = [1205, 1101, 1434, 1320, 923, 874]
# print(v[:3])

