# ========= Урок For 10000.1 =========

# for змінна in range(): 
#     блок коду


# for змінна in range(start,stop,крок):  
#     блок коду


# for змінна in range(0,31,3): # фор жадний і останню циферку з'їдає в stop 
#     print(змінна)

# Задача 1: Загадка про чарівні яблука
# У саду росте 5 чарівних яблунь. На першій яблуні росте 1 яблуко. 
# На кожній наступній яблуні кількість яблук збільшується вдвічі. 
# Вам потрібно порахувати загальну кількість яблук на всіх яблунях.

# чарівні_яблуні = 5
# яблуко = 1
# кошик = 0
# for i in range(чарівні_яблуні):
#     print(яблуко)
#     кошик+=яблуко
#     яблуко*=2
# print(кошик)


# Задача 2: Подорож крізь ґрати
# Ви йдете по стежці, на якій є 10 ґраток. На кожній ґратці лежить монетка. 
# Ви збираєте всі монетки з ґраток, номер яких ділиться на 2 і на 3 одночасно.
#  Скільки монеток ви зберете?
# монетки = 0
# for i in range(1,10):
#     if i%2==0 and i%3==0:

#         монетки+=1
# print(монетки)

# for i in range(5):
#     if i == 3:
#         continue
#     print(i)

# Загадка про чарівних золотих рибок 🐠
# У тебе є акваріум, де плавають 10 золотих рибок. Ти годуєш їх кожного дня, але є одна умова:
# Кожного парного дня (2-й, 4-й, 6-й і т.д.) ти додаєш в акваріум 3 нові рибки.
# Кожного непарного дня (1-й, 3-й, 5-й і т.д.) ти забираєш 1 рибку (вона стає домашнім улюбленцем).
# Якщо кількість рибок стає 15 або більше, ти перестаєш додавати нових.
# Якщо кількість рибок стає менше ніж 5, ти перестаєш забирати рибок.
# Твоя задача — порахувати, скільки рибок буде в акваріумі через 10 днів.

# 1. Загадка про калькулятор
sum = 0
sum_numbers = None
for i in range(1, 11):
    if i % 2 == 0:
        sum += i * 2
    else:
        sum_numbers += i * 3
print("Сума після обробки:", sum)

# 2. Загадка про чарівний ліс
total = 0
mushrooms = 1
for i in range(1, 11):
    total += mushrooms
    mushrooms += 2
print("Всього грибів у лісі:", total)

# 3. Загадка про скарб гнома
count = 0
for i in range(1, 13):
    if i % 3 == 0:
        count += 1
print("Камені, які взяв гном:", count)
