# Завдання 1: "Список Покупок" (Легко) 

# Створи список з 5 продуктів. Додай ще один через .append(). Видали один через .remove(). Виведи фінальний список та його довжину.

# Prodyktu = ["Яблуко","Груша","Манго","Банан","Апельсин"]

# print(Prodyktu)

# Prodyktu.append("Ківі")

# print(Prodyktu)

# Prodyktu.remove("Яблуко")

# print(Prodyktu)

# Завдання 2: "Топ-3 фильмив" (Середньо) 

# Створи список з 7 фильмив. Відсортуй і виведи ТІЛЬКИ перші 3 за допомогою зрізу [:3].

# pers = ["Локи(1 и 2 сезон)","Месники: Війна нескінченності","Месники: Завершення","Месники","Месники: Ера Альтрона","Перший месник: Протистояння","Залізна людина"]

# print(pers[:3])

# Завдання 3: "Середній Рівень" (Середньо) 

# Список рівнів 5 ворогів: [15, 22, 8, 31, 14]. Порахуй середній рівень: sum(levels) / len(levels).

# rivenu = [15, 22, 8, 31, 14]

# cerednue_rivenu = sum(rivenu) / len(rivenu)

# print(f"Середній рівень {cerednue_rivenu}")

# Завдання 4: "List Comprehension" (Важко) 

# Створи список усіх чисел від 1 до 50, які діляться на 3 БЕЗ залишку. Використай list comprehension з if n % 3 == 0

for x in range(50):
    if x % 2 == 0:
        continue
    print(x)
