# Завдання 3: "Система Авторизації" (Важко) 🔒
# Запитуй логін і пароль. Правильні: admin та 12345.

# Кількість спроб: 3
# Після кожної невдалої — повідомлення з залишком спроб
# Після 3 невдалих → "🔒 Акаунт заблоковано на 30 секунд!" (використай time.sleep(30))
# Потім дати ще 1 шанс, і вже остаточне блокування
# Використай while attempts > 0: та break при успішному вході

# import time

# login = "admin"
# paroli = "12345"

# attempts = 4
# while True:
    
#     login_vveden = input("Введіть логін: ")
#     paroli_vveden = input("Введіть пароль: ")

#     if login == login_vveden and paroli == paroli_vveden:
#         print("Добро пожаловать")
#         break

#     else:
#         attempts -= 1
#         print(f"У вас залишолось {attempts}")

#     if attempts == 1:
#         print("🔒 Акаунт заблоковано на 30 секунд!")
#         time.sleep(30)

#     if attempts == 0:
#         print("🔒 Акаунт заблоковано")
#         break

# Завдання 4: "Банкомат" (Дуже Важко) 🏧
# Створи симулятор банкомату:

# Баланс: 10000 грн
# Меню: Перевірити баланс / Зняти кошти / Покласти кошти / Вийти
# При знятті: перевіряй, чи достатньо коштів
# Зняття можливе тільки сумами, кратними 100
# Використай while True + break для виходу

balance = 10000

print("-------------------------")
print("--------- Меню ----------")
print("-------------------------")
print("--- Перевірити баланс ---")
print("-------------------------")
print("------ Зняти кошти ------")
print("-------------------------")
print("----- Покласти кошти ----")
print("-------------------------")
print("--------- Вийти ---------")
print("-------------------------")

while True:

    vubor = input("Введіть дію: ").lower()
    print("-------------------------")

    if vubor == "перевірити баланс":
        print(f"Ваш баланс {balance}")
        print("-------------------------")
    elif vubor == "зняти кошти":
        vubor2 = int(input("Введіть скільки ви хотите знятти (отмена просто Enter): "))
        print("-------------------------")

        if vubor2 == "":
            print("Отмена")
            print("-------------------------")
            continue
        elif vubor2 == 0:
            print("Нельзя зняти 0 грошей")
            print("-------------------------")
        else:
            if vubor2 % 100 == 0:
                print(f"Знятто {vubor2}")
                print("-------------------------")
                balance -= vubor2
                continue
            else:
                print("Число должно бить кратим к 100")
                print("-------------------------")
                continue

    elif vubor == "покласти кошти":
        vubor3 = int(input("Ведіть скільки ви хотите покласти грошей (отмена просто Enter): "))

        if vubor3 == "":
            print("Отмена")
            print("-------------------------")
            continue
        elif vubor3 == 0:
            print("Нельзя покласти 0 грошей")
            print("-------------------------")
        else:
            if vubor3 <= balance:
                print(f"Ви поклали {vubor3} грошей")
                balance =- vubor3
                print("-------------------------")
                continue

            else:
                print("Вам не хватает грошей")
                print("-------------------------")
                continue

    elif vubor == "вийти":
        print("Виходимо")
        print("-------------------------")
        break
