# Вкладений if
# 2. Задано кількість годин та хвилин. Використовуючи вкладений умовний оператор,
# перевірити, чи введені години та хвилини є допустимими значеннями. Якщо так,
# вивести повідомлення "Введений час є допустимим." 

# minutu = int(input("Введіть годину время: "))
# hour = int(input("Введіть хвилину время: "))
# if 0 <= minutu <= 60 and 0 <= hour <= 24 :
#     print("Введений час є допустимим")
# else:
#     print("Введений час не є допустимим")

# Тернарний оператор

# 6. Визначити, чи є задане число кратним 3 або 5: - За допомогою тернарного оператора

# num = int(input("Введіть число: "))

# if num % 3 == 0:
#     print("Кратне 3")
# elif num % 5 == 0:
#     print("Кратне 5")
# else:
#     print("Не кратне 3 або 5")

# 9. Користувач вводить назву жанру: "rock", "pop", "jazz", "electro", "folk". 
# Програма виводить приклад виконавця.

# a = input("Введи жанр: ").lower()

# match a:
#     case "rock":
#         print("Незнаю")
#     case "pop":
#         print("Незнаю")
#     case "jazz":
#         print("Незнаю")
#     case "electro":
#         print("Незнаю")
#     case "folk":
#         print("Незнаю")
#     case _:
#         print("Невідомий жанр")

# 11. Користувач вводить одиницю виміру (см, дм, м, км) і значення в см. 
# Перевести у вибрану одиницю за допомогою match-case.

value = float(input("Введіть цифру в см: "))
unit = input("У яку одиницю перевести (см, дм, м, км): ").lower()

match unit:
    case "см":
        print(value, "см")
    case "дм":
        print(value / 10, "дм")
    case "м":
        print(value / 100, "м")
    case "км":
        print(value / 100000, "км")
    case _:
        print("Невідома цифру виміру")
