# Що таке бібліотека і як нею користуватись
# import math
# print(pow(5,2))
# print(5**2)
# print(math.pi)
# бібліотека math використовується для математики

# import random
# a = random.randint(0,1) # будь яке випадкове ціле число в проміжку від лівого числа по праве)

# print(a)

# #b = random.randrange(start,stop,step) # будь яке випадкове ціле число вибране з послідовності
# b = random.randrange(0,10,2)
# print(b)
# c = random.uniform(0,10) # випадкове дробове число
# print(c)
# d = random.random() # випадкове дробове число в проміжку від 0 до 1
# print(d)
# e = random.choice([15345,234,3134,51345]) # випадковий елемент з cписку
# print(e)
# spusok = [1,2,3,4,5]
# print(spusok)
# random.shuffle(spusok) # перемішування елементів у cписку
# print(spusok)

# Гра вгадай число
# import random

# a = random.randint(1,100) # загадане число
# poputki = 0
# while poputki <3:
#     b = int(input("Спробуй вгадати загадане число ")) 
#     if b > a:
#         print("Забагато")
#         poputki += 1
#     elif a > b:
#         print("Замало!")
#         poputki += 1
#     else:
#         print(f"Вітаю, ти вгадав число {a}")
#         break

# Я загадав число від 1 до 20. Уяви, що це твій скарб, а ти - шукач скарбів.
# Твоє завдання - знайти його, вгадуючи числа. Після кожної твоєї спроби я буду казати, наскільки ти близько:
# "Дуже гаряче! 🔥", якщо ти майже знайшов скарб (різниця у 1-2 числах).
# "Тепло. 😊", якщо ти близько, але ще не поруч (різниця у 3-5 чисел).
# "Холодно. 🥶", якщо ти ще далеко (різниця більше 5 чисел).

# import random

# g = random.randint(1,10000000)
# a = random.randint(1,20)
# while True:
#     b = int(input("Спробуй вгадати загадане число ")) 
#     c = abs(a-b)
#     if c >= 1 and c <= 2:
#         print("Дуже гаряче! 🔥")
#     elif c >= 3 and c <= 5:
#         print("Тепло. 😊")
#     elif c > 5:
#         print("Холодно. 🥶")
#     else:
#         print(f"Ви виграли {g} домов")
#         break

# Орел чи Решка 🪙
# Умова: Ти кидаєш монетку. Тобі потрібно вгадати, що випаде — "орел" чи "решка".
# Як це працює:
# Комп'ютер випадковим чином обирає 0 або 1. Ми домовляємось, що 0 — це "орел", а 1 — "решка".
# Ти вводиш своє припущення.
# Програма порівнює твоє припущення з тим, що випало насправді.

# import random
# a = random.randint(0,1)
# можливі_результати = ["орел","решка"]
# результат_кидка = random.choice(можливі_результати)
# припущення_гравця = input("Введи своє припущення (орел чи решка)")
# if припущення_гравця == результат_кидка:
#     print(f"Правильно! Випав {результат_кидка}")
# else:
#     print(f"На жаль, ти не вгадав :(  . Випав {результат_кидка}")

# Домашка

# Загадати 3 випадкові цифри від 0 до 9.

# Дати тобі 3 спроби, щоб вгадати кожну з них по черзі.

# Після кожної спроби повідомити, чи правильна цифра.

# Якщо ти вгадаєш усі три цифри, скриня відчиниться!

# Якщо ні — закляття залишиться, і скарб не дістанеться.