a1 = float(input("Введіть 1 число: "))
print("============================")
a2 = float(input("Введіть 2 число: "))
print("============================")
a3 = int(input("""Введіть що вибрати:"
"==========="
"1 мінус"
"==========="
"2 плюс"
"==========="
"3 діленя"
"==========="
"4 множення """))

if a3 == 1:
    z = a1 - a2
    
if a3 == 2:
    z = a1 + a2

if a3 == 3:
    if a1 == 0:
        print("========== На нуль не можно ділити ===========")
    z = a1 / a2

if a3 == 4:
    z = a1 * a2

print("========== Результат дії =========")

print(z)