# Користувач вводить годину (ціле число від 0 до 23).
# Програма визначає:

# якщо година від 6 до 11 → "Доброго ранку!"

# якщо від 12 до 17 → "Добрий день!"

# якщо від 18 до 22 → "Добрий вечір!"

# якщо від 23 до 5 → "Доброї ночі!"

# if hours < 0 and hours >=24:
#     print("Введіть корректну годину")
# else:
# hours = 1
# while hours >=0 and hours <= 23:
#     hours = int(input("Введіть годину: (0-23)"))
#     if hours >=6 and hours <= 11:
#         print("Доброго ранку")
#     elif hours >=12 and hours <= 17:
#         print("Добрий день")
#     elif hours >=18 and hours <= 22:
#         print("Добрий вечір")
#     else:
#         print("Доброї ночі")
# print("Ви ввели не корректну годину!")

# Задача: Автомат з напоями

# Умова:
# Користувач вводить номер напою:

# 1 → «Кава — 30 грн»

# 2 → «Чай — 25 грн»

# 3 → «Сік — 40 грн»

# 4 → «Вода — 15 грн»

# Якщо ввели інший номер → вивести "Такого напою немає".

# print("1. Кава — 30 грн")
# print("2. Чай — 25 грн")
# print("3. Сік — 40 грн")
# print("4. Вода — 15 грн")
# print("Зробіть свій вибір (виберіть цифру від 1 до 4 включно)")
# choice = int(input("Оберіть цифру 1-4 "))
# if choice == 1:
#     print("Кава — 30 грн. Смачного!")
# elif choice == 2:
#     print("Чай — 25 грн. Смачного!")
# elif choice == 3:
#     print("Сік — 40 грн. Смачного!")
# elif choice == 4:
#     print("Вода — 15 грн. Смачного!")
# else:
#     print("Такого напою немає, зробіть корректний вибір!")

# Задача: Пароль

# Умова:
# Система має збережений пароль "python123".
# Користувач повинен вводити пароль доти, поки не введе правильно.
# Правила:

# Якщо введений пароль неправильний → вивести "Невірний пароль, спробуй ще раз".

# Якщо правильний → вивести "Доступ дозволено ✅" і завершити програму.

# password = "python123"
# attempt = ""
# while password != attempt:
#     attempt = input("Введіть пароль: ")
#     if password != attempt:
#         print("Невірний пароль, спробуйте ще раз!")
# print("Доступ дозволено ✅")

# Умова:
# Користувач хоче назбирати певну суму грошей (мета).
# Програма у циклі while питає, скільки він поклав у скарбничку цього разу, і додає цю суму.
# Цикл триває, доки накопичена сума не досягне або не перевищить мету.
# Після цього програма виводить:

# "Мета досягнута!"

# скільки грошей вийшло в сумі

# скільки разів довелося класти гроші.


# goal = int(input("Яку суму хочеш назбирати "))
# total = 0
# count = 0
# while goal>total:
#     deposit = int(input("Скільки кладемо в скарбничку цього разу? "))
#     total += deposit
#     count += 1
# print("Мета досягнута!")
# print(f"Всього назбирано {total} грн")
# print(f"Кількість внесень в скарбничку {count}")

#                       Домашка

p = input("Назва товару: ")
t = int(input("Кількість: "))
b = float(input("Ціна за одиницю: "))
q = input("Знижкова картка? так/ні: ").lower()

s = t * b

if t > 20:
    s *= 0.9
elif t > 10:
    s *= 0.95

if q == "так":
    s *= 0.97

print("Товар:", p)
print("Кількість:", t)
print("Ціна за одиницю:", b, "грн")
print("До сплати:", (s) , "грн")