# Завдання 1: "Покарання Гаррі Поттера" (Легко) 

# Напиши код з циклом for, який виводить 100 разів:
#  "Я більше не буду варити зілля на перерві".
#  Кожне речення пронумероване: 1. Я більше не буду...

# for x in range(100):
#     print(f"{x} Я більше не буду варити зілля на перерві")

# Завдання 2: "Таблиця множення" (Середньо) 

# Запитай число і виведи його таблицю множення від 1 до 10

vvediti = int(input("Введіть число щоб дізнатися таблицю множення: "))

for a in range(11):
    zuclo = vvediti * a
    print(f"{a}. {zuclo}")
