# # if перекладається як "якщо"
# # elif перекладається як "або якщо"
# # else перекладається як "в іншому випадку "

# # ============================== Розглядаємо If =============================

# # Як його писати?
# # if умова:
# #     блок коду

# відступи після двокрапки ОБОВ'ЯЗКОВІ ДЛЯ блоку коди що входить до умови яку ми створили
# # Що таке умова??? Для умови ми викорстовуємо bool 
# # Що таке bool? True або False
# # Що таке True?
# #True це коли умова дійсна або правдива
# #Як створити умову? 
# #Ми можемо створити умову за допомогою операторів порівняння
# # == - дорівнює
# # != - не дорівнює
# # > - більше
# # < - менше
# # >= - більше або дорівнює
# # <= - менше або дорівнює
# # Приклади різних умов які можуть зустрічатись в коді
# # Приклад 1
# # Умова True завжди виконається
# if True:
#     print("Це завжди виконається")

# # Приклад 2
# # Умова False завжди не виконається
# if False:
#     print("Це ніколи не виконається")
# # Приклад 3
# if a > b:
#     print("a більше b")
# # Приклад 4
# if a < b:
#     print("a менше b")
# if a>b and a > c:        # and означає і
#     print("a найбільше")
# if a<b and a < c:
#     print("a найменше")
# # Приклад 5
# if a == b:
#     print("a дорівнює b")
# if a != b:
#     print("a не дорівнює b")
# if a >= b:
#     print("a більше або дорівнює b")
# if a <= b:
#     print("a менше або дорівнює b")
# # Приклад 6
# if a not in b: # not означає не 
#     print("a не входить в b")
# if a in b: # in означає входить
#     print("a входить в b")
# # Приклад 7
# if a > 0 or a < 0:       # or означає або
#     print("a не дорівнює 0")
# if a == 0:
#     print("a дорівнює 0")

# # Приклад 8
# if a > 0:
#     print("a додатне")
# elif a < 0:
#     print("a від'ємне")

# # НЕ МОЖНА ПИСАТИ ОСЬ ТАК :
# if a>b>c: # НЕ МОЖНА ПИСАТИ ТАК потрібно використовувати and або or 

# # Приклад 9
# if name == "Петя":
#     print("Привіт, Петя!")
# elif name == "Вася":
#     print("Привіт, Вася!")
# elif name == "Коля":
#     print("Привіт, Коля!")
# else:
#     print("Привіт, незнайомий!")


# Приклад виконання завдання 
# 13. В данній программі зробимо медичного помічника який за введеною нами температурою
# буде показувати стан здоров'я людини.

# Гайд по виконанню типового завдання
# Перше - створюємо змінну з назвою яка відповідає завданню
# введеною нами температурою означає що ми повинні використати метод input , 
# оскільки температура це число дробове тому ми використовуємо його разом з float 
# FLOAT - це дробові числа 
# temperature = float(input("Введіть температуру тіла ")) #обов'язково потрібно повністю розписувати задачу не лише для краси а і інформативності

# #Завдання стоїть в тому щоб ми могли допомогати розрізняти різні температури і показати стан здоров'я

# # приблизно знаємо або вигадуємо що у нас є 4 стана здоров'я 
# #Перший це понижена температура за умови що в нас температура тіла менша 35 градусів
# if temperature > 30 and temperature < 42:
#     if temperature < 35.0: # менше 35 - це температура 34.9
#         print("Стан здоров'я: понижена температура!!! Зверніться до лікаря ")
#     # Далі ми повинні використовувати наступні умови 
#     elif temperature >=35.0 and temperature <= 37.0:
#         print("Стан здоров'я: нормальна температура! Випийте чаю і сідайте програмувати ")
#     # Знову ж таки наступна умова
#     elif temperature > 37.0 and temperature <39.0:
#         print("Стан здоров'я: підвищена температура!!! Зверніться до лікаря ")
#     # В іншому випадку 
#     else: 
#         print("Стан здоров'я: лихоманка! Викликайте швидку ")
# else:
#     print("Введена температура не відповідає нормі")










# Повторення циклу while ==============================================

# Написання while
# while умова: # Що таке умова дивитись на рядок 13
#     блок коду,коли умова істинна або правдива або True



# # Щоб зробити бескінечний цикл використовуємо просто True
# while True:
#     print("Бескінечний цикл")
# Краще використовувати ось таким чином
# a = True
# while a:
#     print("Бескінечний цикл")
#     b = input("Виберіть дію : ")
#     if b == "вийти":
#         a = False # False - це спосіб виключити цикл 
# # приклад 1 Вивід чисел від 1 до 10 
# a = 1
# while a <= 10:
#     print(a)
#     a += 1

# # Приклад 2 вивести привіт 10 разів 
# a = 10
# while a >= 1:
#     print("Привіт ")
#     a -= 1

# # Що таке break - вимкнути цикл і продовжити код після нього 
# while True:
#     b = input("Виберіть дію : ")
#     if b == "вийти":
#         break # break - це спосіб виключити цикл 

# ==============================Міні лайфхак як зациклити будь яку програму ========================
# ==================================================================================================
# Ми повинні спочатку написати while True: а потім виділити всю свою програму і нажати кнопку TAB 
# ==================================================================================================
# ==================================================================================================
# ==================================================================================================


# while True:
#     temperature = float(input("Введіть температуру тіла ")) #обов'язково потрібно повністю розписувати задачу не лише для краси а і інформативності

#     #Завдання стоїть в тому щоб ми могли допомогати розрізняти різні температури і показати стан здоров'я

#     # приблизно знаємо або вигадуємо що у нас є 4 стана здоров'я 
#     #Перший це понижена температура за умови що в нас температура тіла менша 35 градусів
#     if temperature > 30 and temperature < 42:
#         if temperature < 35.0: # менше 35 - це температура 34.9
#             print("Стан здоров'я: понижена температура!!! Зверніться до лікаря ")
#         # Далі ми повинні використовувати наступні умови 
#         elif temperature >=35.0 and temperature <= 37.0:
#             print("Стан здоров'я: нормальна температура! Випийте чаю і сідайте програмувати ")
#         # Знову ж таки наступна умова
#         elif temperature > 37.0 and temperature <39.0:
#             print("Стан здоров'я: підвищена температура!!! Зверніться до лікаря ")
#         # В іншому випадку 
#         else: 
#             print("Стан здоров'я: лихоманка! Викликайте швидку ")
#     else:
#         print("Введена температура не відповідає нормі")

# Continue --------------------------------------------
# Використовуємо тоді коли ми хочемо не переривати цикл а по певній причині пропустити якийсь блок циклу

# # Приклад використання continue
# while True:
#     name = input("Введіть ім'я: ")
#     if name != "Я":
#         continue # повертає нас на початок циклу без його зупинки і без продовження коду який йде після нього 
#     print("Привіт, " + name)
#     break # break - це спосіб виключити цикл 


# ========================================= ПРИКЛАД ЗАДАЧІ З WHILE =========================================
# 10.Вклад у банку становить x гривень. Щороку він збільшується на p відсотків, після чого
# чого дробову частину копійок відкидають. Визначте, через скільки років вклад
# ставитиме не менше y гривень.

# Аналізуємо ми маємо змінні x, p, y !
# x  = вклад у банку
# y = вклад в майбутньому який ми хочемо забрати
# p = відсоток який ми отримуємо кожен рік

# Ми знаємо що щороку збільшується на p відсотків, і нам потрібно визначити через скільки років вклад буде > y



# Спосіб один
# Починаємо з змінних, оскільки нам не надані значення ми використовуємо input!!! І оскільки ми працюємо з банком це все гроші, тобто числа
#Суть задачі знайти через скільки років ми отримаємо бажаний вклад
#Отже нам потрібно знайти роки і створити для них окрему змінну
# x = float(input("Введіть вклад у банку: "))
# y = float(input("Введіть вклад в майбутньому який ми хочемо забрати: "))
# p = float(input("Введіть відсоток який ми отримуємо кожен рік: "))
# i=0
# while x<y:
#     x*=1 + p/100
#     print(x)
#     x = int(100*x)/100
#     print(x)
#     i+=1
#     print(f"Років пройшло з моменту першого вкладу {i}")

# print(i,"Років потрібно для того щоб отримати бажаний вклад")

# Абонент платить за мобільний інтернет m грн щомісяця. Якщо він перевищує ліміт у k ГБ, кожен додатковий гігабайт коштує d грн.
# Напишіть програму, яка за кількістю використаних гігабайтів g визначає, скільки треба заплатити.
# (Використовуємо if: чи перевищив ліміт, чи ні).

# m = int(input("Плата: "))
# d = int(input("Скільки коштує гігабайт:  "))
# g = int(input("Використано гігабайтов: "))
# k = int(input("Ліміт: "))
# if g > k: 
#     total = (g - k) * d
#     print("Ви перевищили ліміт")
#     print("З вас",total)
# else:
#     print("Ви не перевищили ліміт")
#     print("З вас",m)

# 2. Теплий чи холодний чай
# У термосі температура чаю t градусів. Якщо температура вище 60 – чай гарячий, якщо від 30 до 60 – теплий, а якщо нижче – холодний.
# Виведіть повідомлення, у якій категорії напій.
# t = int(input("Градусів: "))
# if 60 < t:
#     print("Чай гарячий")
# elif 30 <= t <= 60:
#     print("Чай теплий")
# else:
#     print("Чай холодний")

# 3. Кінотеатр
# Квиток у кіно коштує q грн. Якщо глядачеві менше 12 років, йому дають знижку 50%, а якщо більше 60 років – знижку 30%.
# Напишіть програму, яка визначає вартість квитка для людини з віком a.
# q = int(input("Коштує квиток: "))
# a = int(input("Лет: "))
# if a < 12:
#     Cyma = q * 0.5
#     print(Cyma)
# elif a > 60:
#     Cyma = q * 0.7
#     print(Cyma)


#                                       Домашка

# Користувач вводить суму зняття. Банкомат видає тільки купюри по 50 грн.
# Працюйте в циклі while, доки користувач не введе число, кратне 50.
# Використовуйте if, щоб перевіряти правильність введення.
# while True:

#     amount = int(input("Введіть суму зняття кратну 50: "))
#     if amount % 50 == 0:
#         print("Банкомат видасть вам", amount, "грн купюрами по 50 грн.")
#         break
#     else:
#         print("Сума повинна бути кратною 50. Спробуйте ще раз.")

# password = int(input(""))
# attempts = 0

# Користувач вводить пароль.

# Якщо він правильний — вивести "Доступ дозволено" і зупинити цикл.

# Якщо неправильний — просити повторно (while).

# Якщо введено більше 3 разів — вивести "Доступ заборонено".

# while attempts < 3:
#     paroli = input("Введіть пароль: ")
#     if paroli == password:
#         print("Доступ дозволено")
#         break
#     else:
#         attempts += 1

# if attempts == 3:
#     print("Доступ заборонено")

# Користувач вводить числа.

# Якщо число додатне → додаємо до суми.

# Якщо число нуль або від’ємне → зупиняємо цикл.
# Вивести суму всіх додатних чисел.

# s = 0
# while True:
#     n = int(input("Введіть число: "))
#     if n > 0:
#         s += n
#     else:
#         break
# print("Сума всіх додатних чисел:", s)

# Комп’ютер "задумав" число secret від 1 до 50.
# Користувач вводить спроби:

# Якщо менше → вивести "Мало".

# Якщо більше → "Багато".

# Якщо вгадав → "Ура!" і цикл зупиняється.

# secret = (23)
# while True:
#     g = int(input("Введіть число від 1 до 50: "))
#     if g < secret:
#         print("Мало")
#     elif g > secret:
#         print("Багато")
#     else:
#         print("Ура!")
#         break

# Будинок має 9 поверхів. Ліфт піднімається з 1-го на потрібний поверх.
# Користувач вводить номер поверху:

# Якщо число від 1 до 9 → ліфт їде (while до досягнення поверху).

# Якщо неправильний номер → вивести "Такого поверху немає" і попросити знову (if).

# while True:
#     f = int(input("Введіть номер поверху (1-9): "))
#     if 1 <= f <= 9:
#         print("Ви на ",f," поверсі!")
#         break
#     else:
#         print("Такого поверху немає. Спробуйте ще раз.")